tap "candid82/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# apps
cask "firefox"
cask "google-chrome"
cask "slack"

# dev
brew "curl"
brew "fzf"
brew "git"
brew "ripgrep"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "yqrashawn/goku/goku"
brew "zsh-completions"
cask "iterm2"
cask "karabiner-elements"
tap "yqrashawn/goku"

# asdf
brew "asdf"
brew "coreutils"

# node
brew "gnupg"
brew "gawk"

# ruby
brew "shared-mime-info"

# redis
brew "redis"
