tap "candid82/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# apps
cask "firefox"
cask "google-chrome"
cask "slack"
cask "spotify"
cask "discord"
brew "gopass"

# dev
brew "curl"
brew "fzf"
brew "git"
brew "heroku/brew/heroku"
brew "neovim"
brew "ripgrep"
brew "tree"
brew "v8-315"
brew "yqrashawn/goku/goku"
cask "karabiner-elements"
tap "yqrashawn/goku"

# asdf
brew "asdf"
brew "coreutils"

# lucky
tap "luckyframework/homebrew-lucky"
brew "lucky"
brew "overmind"

# node
brew "gnupg"
brew "gawk"

# ruby
brew "shared-mime-info"

# postgresql
cask "postgres-unofficial"

# redis
brew "redis"

# terminal
cask "iterm2"
brew "zsh-completions"
brew "tmux"
brew "tmux-mem-cpu-load"
