# tap "candid82/brew"
# tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "homebrew/core"

# apps
# cask "firefox", usualy manually installed
cask "google-chrome"
cask "spotify"
cask "discord"
cask "google-drive"
# brew "gopass"
# cask "slack"

# dev
brew "curl"
brew "fzf"
brew "git"
brew "gpg"
brew "neovim"
brew "ripgrep"
brew "tree"
brew "yqrashawn/goku/goku"
cask "karabiner-elements"
tap "yqrashawn/goku"
# cask "docker", it fails
# brew "heroku/brew/heroku"
# brew "v8-315"

# asdf
brew "asdf"
brew "coreutils"

# node
brew "gnupg"
brew "gawk"
# 
# ruby
brew "shared-mime-info"
brew "openssl@3"
brew "openssl@1.1"
brew "readline"
brew "libyaml"
brew "gmp"

# postgresql
cask "postgres-unofficial"
 
# redis
brew "redis"

# terminal
cask "iterm2"
brew "zsh-completions"
brew "tmux"
brew "tmux-mem-cpu-load"
tap "homebrew/cask-fonts"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-iosevka-nerd-font"
